# -*- coding: utf-8 -*-


class 客話辭典正規化:

    def 處理音標頭前字(self, 音標):
        音標 = 音標.split('）')[-1]
        音標 = 音標.replace('文', '')
        音標 = 音標.replace('白', '')
        return 音標.strip()

    def 調整方言的詞條(self, 詞目, 新音):
        if 詞目 == '毆畀死' and 新音 == 'eu55-bun11-gi55-si53':  # 饒平音無合音
            新詞目 = '毆分佢死'
        elif (詞目, 新音.replace('-', ' ')) in self.海陸表:
            新詞目 = self.海陸表[(詞目, 新音.replace('-', ' '))]
        else:
            新詞目 = 詞目
        return 新詞目, 新音
    海陸表 = {
        ('時錶仔', 'shi55 biau24'): '時錶',
        ('磨刀仔', 'no55 do53'): '磨刀',
        ('紙炮仔', 'zhi24 pau11'): '紙炮',
        ('竹馬仔', 'zhug5 ma53'): '竹馬',
        ('魚脯仔', 'ng55 pu24'): '魚脯',
        ('做粄仔', 'zo11 ban24'): '做粄',
        ('嫩葉仔', 'nun33 rhab2'): '嫩葉',
        ('茶壺仔', 'ca55 fu55'): '茶壺',
        ('嬰兒仔', 'o53 nga11'): '嬰兒',
        ('梅仔樹', 'moi55 shu33'): '梅樹',
        ('種痘仔', 'zhung11 teu33'): '種痘',
        ('送鬼仔', 'sung11 gui24'): '送鬼',
        ('頭臥臥仔', 'teu55 ngo11 ngo11'): '頭臥臥',
        ('時鐘仔', 'shi55 zhung53'): '時鐘'
    }
